In [1]:
###목적에 맞춰 데이터를 준비하고 다듬는 방법 알아보기

In [2]:
import os
import pandas as pd

In [ ]:
###데이터 병합
# 4,5,6 pay-info 데이터 불러와서 한개의 df 병합

In [32]:
os.getcwd()

'/Users/hri/east/data'

In [31]:
os.chdir('../')

In [28]:
os.chdir('data/월별급여')

In [29]:
file_names = os.listdir() ######

In [20]:
file_names

['hr-pay-info-5월.csv', 'hr-pay-info-4월.csv', 'hr-pay-info-6월.csv']

In [30]:
pay_info = pd.DataFrame()
for i in file_names:
    df = pd.read_csv(i, encoding='euc-kr')
    pay_info = pd.concat([pay_info, df])

In [31]:
pay_info

        EID  PAYMENT_DY PAYMENT_DVCD  PAYMENT_AMOUNT
0    E00206    20240501           월급             850
1    E00181    20240501           월급             791
2    E00164    20240501           월급             758
3    E00190    20240501           월급             708
4    E00209    20240501           월급             716
..      ...         ...          ...             ...
146  E00322    20240601           월급             375
147  E00389    20240601           월급             375
148  E00438    20240601           월급             375
149  E00304    20240601           월급             375
150  E00428    20240601           월급             375

[755 rows x 4 columns]

In [16]:
#org_info에 각 조직별 조직 인원 수, 평균나이, 평균근무년수, 평균연봉 추가
org_info = pd.read_csv('data/org-info.csv', encoding='euc-kr', index_col='ORG_CD')

In [ ]:
org_info

In [18]:
hr_info = pd.read_csv('data/hr-info.csv', encoding='euc-kr')

In [19]:
hr_info.groupby('ORG_CD').count()

,EID,ENAME,GENDER,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
ORG_CD,,,,,,,,,,,,,,,,,,,
ORG001,6,6,6,6,6,6,6,6,6,5,6,6,6,6,1,1,1,6,6
ORG002,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1,4,4
ORG003,5,5,5,5,5,5,5,5,5,4,5,5,5,5,0,0,0,5,5
ORG004,11,11,11,11,11,11,11,11,11,11,11,11,11,11,3,3,3,11,11
ORG005,8,8,8,8,8,8,8,8,8,7,8,8,8,8,2,2,2,8,8
ORG006,6,6,6,6,6,6,6,6,6,6,6,6,6,6,1,1,1,6,6
ORG007,7,7,7,7,7,7,7,7,7,7,7,7,7,7,1,1,1,7,7
ORG008,5,5,5,5,5,5,5,5,5,5,5,5,5,5,2,2,2,5,5
ORG009,5,5,5,5,5,5,5,5,5,4,5,5,5,5,2,2,2,5,5
ORG010,3,3,3,3,3,3,3,3,3,3,3,3,3,3,0,0,0,3,3
ORG011,5,5,5,5,5,5,5,5,5,5,5,5,5,5,1,1,1,5,5
ORG012,5,5,5,5,5,5,5,5,5,4,5,5,5,5,0,0,0,5,5
ORG013,8,8,8,8,8,8,8,8,8,8,8,8,8,8,3,3,3,8,8
ORG014,8,8,8,8,8,8,8,8,8,7,8,8,8,8,1,1,1,8,8
ORG015,3,3,3,3,3,3,3,3,3,3,3,3,3,3,0,0,0,3,3
ORG016,8,8,8,8,8,8,8,8,8,8,8,8,8,8,1,1,1,8,8
ORG017,10,10,10,10,10,10,10,10,10,7,10,10,10,10,5,5,5,10,10
ORG018,6,6,6,6,6,6,6,6,6,6,6,6,6,6,1,1,1,6,6
ORG019,10,10,10,10,10,10,10,10,10,8,10,10,10,10,0,0,0,10,10
ORG020,3,3,3,3,3,3,3,3,3,2,3,3,3,3,0,0,0,3,3
ORG021,12,12,12,12,12,12,12,12,12,11,12,12,12,12,4,4,4,12,12
ORG022,4,4,4,4,4,4,4,4,4,4,4,4,4,4,2,2,2,4,4
ORG023,12,12,12,12,12,12,12,12,12,11,12,12,12,12,5,5,5,12,12
ORG024,5,5,5,5,5,5,5,5,5,4,5,5,5,5,0,0,0,5,5
ORG025,8,8,8,8,8,8,8,8,8,8,8,8,8,8,4,4,4,8,8
ORG026,5,5,5,5,5,5,5,5,5,4,5,5,5,5,1,1,1,5,5
ORG027,7,7,7,7,7,7,7,7,7,6,7,7,7,7,4,4,4,7,7
ORG028,4,4,4,4,4,4,4,4,4,4,4,4,4,4,0,0,0,4,4
ORG029,4,4,4,4,4,4,4,4,4,4,4,4,4,4,1,1,1,4,4
ORG030,10,10,10,10,10,10,10,10,10,9,10,10,10,10,3,3,3,10,10

In [20]:
#조직정보데이터랑 인사정보데이터에서 공통넉으로 갖고 있는 컬럼 ORG_CD
#ORG_CD를 기준으로 groupby -> 즉, org_info와 인덱스가 같아짐

#hr_info에서 groupby를 이용해서 부서별 부서 인원수, 평균나이, 평균근무년수, 평균연봉 구하기
or_agg = hr_info.groupby('ORG_CD').agg({'ENAME' : 'count', 'AGE' : 'mean', 'SERVICE_YEAR' : 'mean', 'SALARY' : 'mean'})

In [21]:
or_agg['AGE'] = or_agg['AGE'].astype(int)

In [22]:
or_agg

        ENAME  AGE  SERVICE_YEAR       SALARY
ORG_CD
ORG001      6   26      0.333333  5033.333333
ORG002      4   34      7.500000  6550.000000
ORG003      5   34      7.600000  6480.000000
ORG004     11   35      7.000000  6445.454545
ORG005      8   29      2.000000  5525.000000
ORG006      6   30      4.166667  5966.666667
ORG007      7   36      8.000000  6728.571429
ORG008      5   32      5.200000  6020.000000
ORG009      5   29      2.200000  5520.000000
ORG010      3   33      5.666667  6300.000000
ORG011      5   37      8.400000  6660.000000
ORG012      5   29      2.600000  5680.000000
ORG013      8   32      3.625000  5950.000000
ORG014      8   32      5.000000  6025.000000
ORG015      3   24      0.000000  5000.000000
ORG016      8   35      7.250000  6500.000000
ORG017     10   29      2.700000  5520.000000
ORG018      6   30      3.000000  5716.666667
ORG019     10   29      2.400000  5440.000000
ORG020      3   26      0.333333  5066.666667
ORG021     12   34      6.666667  6400.000000
ORG022      4   32      3.750000  6025.000000
ORG023     12   30      3.083333  5658.333333
ORG024      5   30      4.400000  5740.000000
ORG025      8   31      5.500000  6200.000000
ORG026      5   26      0.400000  5140.000000
ORG027      7   33      5.714286  6228.571429
ORG028      4   34      5.250000  6150.000000
ORG029      4   35      6.500000  6275.000000
ORG030     10   29      2.400000  5550.000000

In [74]:
#org_info와 hr_info 데이터에서 추출한 df을 가로로 병합
final_df = pd.concat([org_info, or_agg], axis=1)

In [75]:
final_df

,ENG_DIVISION,KOR_DIVISION,ENG_DEPARTMENT,KOR_DEPARTMENT,Team,KOR_TEAM,Role,ENAME,AGE,SERVICE_YEAR,SALARY
ORG_CD,,,,,,,,,,,
ORG001,Home Entertainment Division,HE사업본부,TV Business Operations Department,TV사업운영센터,TV Product Management Team,TV 제품 관리 팀,관리 및 마케팅 전략 수립을 통해 TV 제품의 전체 라이프사이클을 관리합니다.,6,26,0.333333,5033.333333
ORG002,Home Entertainment Division,HE사업본부,TV Business Operations Department,TV사업운영센터,TV Marketing Team,TV 마케팅 팀,"TV 제품의 시장 진입 전략을 수립하고, 광고 및 프로모션 활동을 기획합니다.",4,34,7.500000,6550.000000
ORG003,Home Entertainment Division,HE사업본부,TV Business Operations Department,TV사업운영센터,TV Customer Support Team,TV 고객 지원 팀,TV 고객 지원 서비스 제공 및 고객 만족도를 높이기 위한 해결책을 제공합니다.,5,34,7.600000,6480.000000
ORG004,Home Entertainment Division,HE사업본부,webOS Software Development Department,webOS SW개발그룹,webOS Core Development Team,webOS 핵심 개발 팀,webOS 플랫폼의 핵심 기능 개발 및 유지보수를 담당합니다.,11,35,7.000000,6445.454545
ORG005,Home Entertainment Division,HE사업본부,webOS Software Development Department,webOS SW개발그룹,webOS User Interface Team,webOS 사용자 인터페이스 팀,webOS의 사용자 인터페이스 디자인 및 개선을 담당합니다.,8,29,2.000000,5525.000000
ORG006,Home Entertainment Division,HE사업본부,webOS Software Development Department,webOS SW개발그룹,webOS Quality Assurance Team,webOS 품질 보증 팀,webOS 소프트웨어의 품질 검증 및 테스트를 수행합니다.,6,30,4.166667,5966.666667
ORG007,Vehicle Solutions Division,VS사업본부,Global Customer Strategy Department,글로벌고객전략담당,Global Sales Strategy Team,글로벌 판매 전략 팀,"글로벌 판매 전략을 수립하고, 주요 시장에서의 판매 목표를 설정합니다.",7,36,8.000000,6728.571429
ORG008,Vehicle Solutions Division,VS사업본부,Global Customer Strategy Department,글로벌고객전략담당,Key Account Management Team,주요 고객 관리 팀,"주요 고객과의 관계를 관리하고, 맞춤형 솔루션을 제공합니다.",5,32,5.200000,6020.000000
ORG009,Vehicle Solutions Division,VS사업본부,Global Customer Strategy Department,글로벌고객전략담당,Customer Insights Team,고객 통찰 팀,"고객 데이터를 분석하여 인사이트를 도출하고, 이를 기반으로 제품 및 서비스 개선안을...",5,29,2.200000,5520.000000
ORG010,Vehicle Solutions Division,VS사업본부,VS Asia Sales/PM Department,VS아시아영업/PM담당,Asia Regional Sales Team,아시아 지역 판매 팀,"아시아 지역에서의 판매 활동을 관리하고, 시장 진입 전략을 수립합니다.",3,33,5.666667,6300.000000
ORG011,Vehicle Solutions Division,VS사업본부,VS Asia Sales/PM Department,VS아시아영업/PM담당,Project Management Team,프로젝트 관리 팀,"프로젝트 계획 수립 및 실행, 리소스 관리 및 일정 관리를 담당합니다.",5,37,8.400000,6660.000000
ORG012,Vehicle Solutions Division,VS사업본부,VS Asia Sales/PM Department,VS아시아영업/PM담당,Technical Sales Support Team,기술 영업 지원 팀,"기술적 지원을 제공하여 고객의 요구사항을 해결하고, 제품의 기술적 장점을 설명합니다.",5,29,2.600000,5680.000000
ORG013,Home Appliance and Air Solution Division,HA사업본부,Kitchen Solutions Department,키친솔루션사업부,Kitchen Appliance Development Team,주방 가전 개발 팀,주방 가전 제품의 개발 및 설계를 담당합니다.,8,32,3.625000,5950.000000
ORG014,Home Appliance and Air Solution Division,HA사업본부,Kitchen Solutions Department,키친솔루션사업부,Kitchen Product Marketing Team,주방 제품 마케팅 팀,주방 제품의 마케팅 전략 수립 및 실행을 담당합니다.,8,32,5.000000,6025.000000
ORG015,Home Appliance and Air Solution Division,HA사업본부,Kitchen Solutions Department,키친솔루션사업부,Kitchen Customer Service Team,주방 고객 서비스 팀,주방 가전 제품에 대한 고객 지원 및 서비스 제공을 담당합니다.,3,24,0.000000,5000.000000
ORG016,Business Solutions Division,BS사업본부,B2B India Business Department,B2B인도사업담당,India B2B Sales Team,인도 B2B 판매 팀,"인도 지역 B2B 판매 활동을 관리하고, 고객 맞춤형 솔루션을 제공합니다.",8,35,7.250000,6500.000000
ORG017,Business Solutions Division,BS사업본부,B2B India Business Department,B2B인도사업담당,India Market Analysis Team,인도 시장 분석 팀,인도 시장에 대한 분석을 통해 시장 전략을 수립합니다.,10,29,2.700000,5520.000000
ORG018,Business Solutions Division,BS사업본부,B2B India Business Department,B2B인도사업담당,India Customer Support Team,인도 고객 지원 팀,인도 지역 고객에 대한 지원 및 서비스를 제공합니다.,6,30,3.000000,5716.666667
ORG019,Business Solutions Division,BS사업본부,North America Innovation Center,북미이노베이션센터,Innovation Research Team,혁신 연구 팀,신기술 연구 및 혁신적인 제품 개발을 주도합니다.,10,29,2.400000,5440.000000
ORG020,Business Solutions Division,BS사업본부,North America Innovation Center,북미이노베이션센터,New Business Development Team,신사업 개발 팀,"새로운 비즈니스 기회를 발굴하고, 사업화를 추진합니다.",3,26,0.333333,5066.666667
ORG021,Business Solutions Division,BS사업본부,North America Innovation Center,북미이노베이션센터,North America Sales Team,북미 판매 팀,북미 지역 판매 전략 수립 및 실행을 담당합니다.,12,34,6.666667,6400.000000
ORG022,Production Engineering Research Institute,생산기술원,Production Technology Development Team,생산기술개발팀,Production Process Improvement Team,생산 공정 개선 팀,생산 공정의 효율성을 개선하고 최적화하는 작업을 수행합니다.,4,32,3.750000,6025.000000
ORG023,Production Engineering Research Institute,생산기술원,Production Technology Development Team,생산기술개발팀,Advanced Manufacturing Team,첨단 제조 팀,첨단 제조 기술 개발 및 생산성 향상 작업을 수행합니다.,12,30,3.083333,5658.333333
ORG024,Production Engineering Research Institute,생산기술원,Production Technology Development Team,생산기술개발팀,Production Quality Control Team,생산 품질 관리 팀,"생산 품질을 관리하고, 품질 문제를 해결합니다.",5,30,4.400000,5740.000000
ORG025,Human Resources,HR,Chief Human Resources Officer Department,최고인사책임자(CHO) 부서,Talent Acquisition Team,인재 채용 팀,"인재 채용 전략 수립 및 실행, 채용 프로세스 관리.",8,31,5.500000,6200.000000
ORG026,Human Resources,HR,Chief Human Resources Officer Department,최고인사책임자(CHO) 부서,Employee Development Team,직원 개발 팀,직원 교육 및 개발 프로그램 기획 및 실행.,5,26,0.400000,5140.000000
ORG027,Human Resources,HR,Chief Human Resources Officer Department,최고인사책임자(CHO) 부서,Compensation and Benefits Team,보상 및 복리후생 팀,직원 보상 및 복리후생 제도 관리.,7,33,5.714286,6228.571429
ORG028,Home Entertainment Division,HE사업본부,Washing Machine Operations Department,세탁기운영센터,Parts Development Team,부품개발팀,세탁기 부품의 개발 및 개선을 담당합니다.,4,34,5.250000,6150.000000
ORG029,Home Entertainment Division,HE사업본부,Washing Machine Operations Department,세탁기운영센터,Analysis Team,분석팀,세탁기 성능 및 사용자 로그 데이터를 분석하고 보고서를 작성합니다.,4,35,6.500000,6275.000000
ORG030,Home Entertainment Division,HE사업본부,Washing Machine Operations Department,세탁기운영센터,Information Management Team,정보관리팀,"세탁기 관련 정보의 수집, 저장, 관리 및 배포를 담당합니다.",10,29,2.400000,5550.000000

In [ ]:
#merge하기
- 공통된 컬럼을 기준으로 데이터를 병합할때 사용
- 데이터베이스의 조인 개념을 떠올리면 쉬움

In [76]:
#급여 지급내역 데이터 로딩
print(hr_info.shape)  #인사
print(pay_info.shape) #급여

(200, 20)
(755, 4)

In [77]:
hr_info

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
3,E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
4,E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,E00322,부탐회,F,ORG014,P009,23,0,학사 학위,0.00,4500,NaN,4,Java,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
196,E00389,초두반,F,ORG012,P009,23,0,학사 학위,0.00,4500,NaN,4,"Salesforce, Java",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
197,E00438,권개득,M,ORG024,P009,23,0,학사 학위,0.00,4500,NaN,4,Python,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
198,E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
199,E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N

In [78]:
pay_info

        EID  PAYMENT_DY PAYMENT_DVCD  PAYMENT_AMOUNT
0    E00206    20240501           월급             850
1    E00181    20240501           월급             791
2    E00164    20240501           월급             758
3    E00190    20240501           월급             708
4    E00209    20240501           월급             716
..      ...         ...          ...             ...
146  E00322    20240601           월급             375
147  E00389    20240601           월급             375
148  E00438    20240601           월급             375
149  E00304    20240601           월급             375
150  E00428    20240601           월급             375

[755 rows x 4 columns]

In [79]:
set(hr_info.columns) - set(pay_info.columns)

{'ACTIVE_STATE',
 'AGE',
 'EDU_LEVEL',
 'ENAME',
 'GENDER',
 'HIRE_DATE',
 'LAST_PROMO_DT',
 'NATION',
 'ORG_CD',
 'PERFORMANCE_SCORE',
 'POS_CD',
 'REHIRE_YN',
 'RETIRE_DATE',
 'RETIRE_REASON',
 'ROUNDING_DEDUCTION',
 'SALARY',
 'SERVICE_YEAR',
 'SKILLS',
 'TRAINING_HOURS'}

In [80]:
set(hr_info.columns)

{'ACTIVE_STATE',
 'AGE',
 'EDU_LEVEL',
 'EID',
 'ENAME',
 'GENDER',
 'HIRE_DATE',
 'LAST_PROMO_DT',
 'NATION',
 'ORG_CD',
 'PERFORMANCE_SCORE',
 'POS_CD',
 'REHIRE_YN',
 'RETIRE_DATE',
 'RETIRE_REASON',
 'ROUNDING_DEDUCTION',
 'SALARY',
 'SERVICE_YEAR',
 'SKILLS',
 'TRAINING_HOURS'}

In [81]:
set(hr_info.columns) - (set(hr_info.columns) - set(pay_info.columns))

{'EID'}

In [82]:
hr_info_df = hr_info[['EID', 'ENAME', 'GENDER']]
hr_info_df

        EID ENAME GENDER
0    E00206   시이오      M
1    E00181   나사장      F
2    E00164  난부사장      M
3    E00190   판라다      F
4    E00209   누훈봉      M
..      ...   ...    ...
195  E00322   부탐회      F
196  E00389   초두반      F
197  E00438   권개득      M
198  E00304   탐출조      M
199  E00428   을충나      F

[200 rows x 3 columns]

In [85]:
#인사 데이터 정보 기반으로 merge
total_salary_df1 = pd.merge(hr_info_df, pay_info, how='left', on='EID')
total_salary_df1

        EID ENAME GENDER  PAYMENT_DY PAYMENT_DVCD  PAYMENT_AMOUNT
0    E00206   시이오      M  20240501.0           월급           850.0
1    E00206   시이오      M  20240401.0           월급           850.0
2    E00206   시이오      M  20240401.0          성과급           425.0
3    E00206   시이오      M  20240401.0          상여금           300.0
4    E00206   시이오      M  20240601.0           월급           850.0
..      ...   ...    ...         ...          ...             ...
799  E00428   을충나      F  20240501.0           월급           375.0
800  E00428   을충나      F  20240401.0           월급           375.0
801  E00428   을충나      F  20240401.0          성과급           188.0
802  E00428   을충나      F  20240401.0          상여금           300.0
803  E00428   을충나      F  20240601.0           월급           375.0

[804 rows x 6 columns]

In [84]:
#급여지급 내역 기반으로 merge
total_salary_df2 = pd.merge(hr_info_df, pay_info, how='right', on='EID')

In [86]:
total_salary_df2

        EID ENAME GENDER  PAYMENT_DY PAYMENT_DVCD  PAYMENT_AMOUNT
0    E00206   시이오      M    20240501           월급             850
1    E00181   나사장      F    20240501           월급             791
2    E00164  난부사장      M    20240501           월급             758
3    E00190   판라다      F    20240501           월급             708
4    E00209   누훈봉      M    20240501           월급             716
..      ...   ...    ...         ...          ...             ...
750  E00322   부탐회      F    20240601           월급             375
751  E00389   초두반      F    20240601           월급             375
752  E00438   권개득      M    20240601           월급             375
753  E00304   탐출조      M    20240601           월급             375
754  E00428   을충나      F    20240601           월급             375

[755 rows x 6 columns]

In [ ]:
#급여 지급 내역을 중심으로 merge 했을 때, 더 적음.
# 두 데이터에 차이가 있다는 건, 급여지급이 안된 인원들이 있다!

In [87]:
#지급 내역이 없는 인원들 확인
total_salary_df1['PAYMENT_DY'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
799    False
800    False
801    False
802    False
803    False
Name: PAYMENT_DY, Length: 804, dtype: bool

In [91]:
no_money = total_salary_df1[total_salary_df1['PAYMENT_DY'].isnull()]
no_money

        EID ENAME GENDER  PAYMENT_DY PAYMENT_DVCD  PAYMENT_AMOUNT
80   E00207   초디소      M         NaN          NaN             NaN
86   E00239   헌란처      M         NaN          NaN             NaN
102  E00323   묵단언      F         NaN          NaN             NaN
108  E00394   우전회      F         NaN          NaN             NaN
119  E00174   탐선반      M         NaN          NaN             NaN
150  E00274   민남무      M         NaN          NaN             NaN
181  E00334   무공담      M         NaN          NaN             NaN
182  E00445   속묵우      M         NaN          NaN             NaN
203  E00283   도온강      F         NaN          NaN             NaN
204  E00312   장춘란      F         NaN          NaN             NaN
205  E00370   매혁지      M         NaN          NaN             NaN
216  E00493   록로민      F         NaN          NaN             NaN
217  E00179   탁영표      M         NaN          NaN             NaN
218  E00185   주인철      F         NaN          NaN             NaN
219  E00193   방전분      F         NaN          NaN             NaN
230  E00245   처성산      M         NaN          NaN             NaN
291  E00379   권철희      F         NaN          NaN             NaN
322  E00463   숭황예      F         NaN          NaN             NaN
348  E00495   충창동      F         NaN          NaN             NaN
349  E00177   람준분      M         NaN          NaN             NaN
350  E00226   득푸니      M         NaN          NaN             NaN
441  E00480   혁노력      M         NaN          NaN             NaN
442  E00168   인환숙      M         NaN          NaN             NaN
443  E00188   양봉패      F         NaN          NaN             NaN
444  E00198   성해규      M         NaN          NaN             NaN
445  E00200   안랑묵      M         NaN          NaN             NaN
446  E00234   망처문      M         NaN          NaN             NaN
447  E00253   순니충      M         NaN          NaN             NaN
448  E00273   란우함      M         NaN          NaN             NaN
449  E00412   동훼택      M         NaN          NaN             NaN
450  E00357   인치형      M         NaN          NaN             NaN
451  E00380   병전고      F         NaN          NaN             NaN
452  E00472   방부인      F         NaN          NaN             NaN
453  E00494   탄배매      F         NaN          NaN             NaN
454  E00203   희상유      M         NaN          NaN             NaN
455  E00321   반함훼      M         NaN          NaN             NaN
456  E00338   권언차      F         NaN          NaN             NaN
457  E00354   화호할      M         NaN          NaN             NaN
458  E00427   을흥언      F         NaN          NaN             NaN
459  E00465   혁묵복      M         NaN          NaN             NaN
460  E00481   개중말      M         NaN          NaN             NaN
461  E00490   시소표      F         NaN          NaN             NaN
462  E00308   룡단구      M         NaN          NaN             NaN
703  E00367   달니대      F         NaN          NaN             NaN
704  E00450   혁번상      M         NaN          NaN             NaN
705  E00460   춘란시      M         NaN          NaN             NaN
731  E00192   감옥신      F         NaN          NaN             NaN
732  E00275   복판백      M         NaN          NaN             NaN
733  E00281   빈태봉      F         NaN          NaN             NaN

In [93]:
# 지급내역이 없는 사람들이 언제 퇴사를 했는지 확인
pd.merge(no_money, hr_info)[['ENAME','RETIRE_DATE']] #how 생략하면 inner join(교집합)
#급여지금이 없는 사람들은 퇴사한 사람들이었구나!

   ENAME RETIRE_DATE
0    초디소  2022-02-28
1    헌란처  2023-02-28
2    묵단언  2023-02-28
3    우전회  2024-02-29
4    탐선반  2024-02-29
5    민남무  2024-02-29
6    무공담  2024-02-29
7    속묵우  2024-02-29
8    도온강  2024-02-29
9    장춘란  2024-02-29
10   매혁지  2023-02-28
11   록로민  2023-02-28
12   탁영표  2023-02-28
13   주인철  2022-02-28
14   방전분  2022-02-28
15   처성산  2021-02-28
16   권철희  2021-02-28
17   숭황예  2024-03-01
18   충창동  2024-03-01
19   람준분  2024-03-01
20   득푸니  2024-03-01
21   혁노력  2024-03-01
22   인환숙  2024-03-01
23   양봉패  2024-03-01
24   성해규  2024-03-01
25   안랑묵  2024-03-01
26   망처문  2023-03-01
27   순니충  2023-03-01
28   란우함  2023-03-01
29   동훼택  2023-03-01
30   인치형  2023-03-01
31   병전고  2023-03-01
32   방부인  2024-03-01
33   탄배매  2024-03-01
34   희상유  2024-03-01
35   반함훼  2024-03-01
36   권언차  2024-03-01
37   화호할  2024-03-01
38   을흥언  2024-03-01
39   혁묵복  2024-03-01
40   개중말  2024-03-01
41   시소표  2024-03-01
42   룡단구  2023-03-01
43   달니대  2024-05-01
44   혁번상  2024-05-01
45   춘란시  2024-05-01
46   감옥신  2024-02-28
47   복판백  2024-02-28
48   빈태봉  2024-02-28

In [101]:
n = 1
while n < 4:
    for i in range(2):
        print(n, end=" ")
        n += 1

1 2

1 2 3 4

In [96]:
import numpy as np
arr = np.array([1,3.5,"4"])

In [97]:
arr.dtype

dtype('<U32')

In [100]:
s = pd.Series([3,6,9], index=["a","b","c"])
print(s['b'])

6

In [1]:
import pandas as pd
import os

In [12]:
hr_info = pd.read_csv("data/hr-info.csv", encoding='euc-kr')

In [5]:
hr_info.set_index("EID", inplace=True)

In [8]:
hr_info.sort_index(axis=1)

,ACTIVE_STATE,AGE,EDU_LEVEL,ENAME,GENDER,HIRE_DATE,LAST_PROMO_DT,NATION,ORG_CD,PERFORMANCE_SCORE,POS_CD,REHIRE_YN,RETIRE_DATE,RETIRE_REASON,ROUNDING_DEDUCTION,SALARY,SERVICE_YEAR,SKILLS,TRAINING_HOURS
EID,,,,,,,,,,,,,,,,,,,
E00206,Y,49,박사 학위,시이오,M,1999-03-01,2024-03-01,KOREA,NaN,4.50,P001,NaN,NaN,NaN,Y,10200,25,"Marketing, Salesforce",240
E00181,Y,49,박사 학위,나사장,F,2000-03-01,2024-03-01,KOREA,NaN,4.60,P002,NaN,NaN,NaN,Y,9500,24,"Project Management, Marketing",236
E00164,Y,48,박사 학위,난부사장,M,2002-03-01,2024-03-01,KOREA,NaN,4.60,P003,NaN,NaN,NaN,Y,9100,22,"Salesforce, Data Analysis, Java",240
E00190,Y,47,박사 학위,판라다,F,2006-03-01,2024-03-01,KOREA,ORG007,3.51,P004,NaN,NaN,NaN,Y,8500,18,"Java, Data Analysis, Salesforce",96
E00209,Y,47,박사 학위,누훈봉,M,2005-03-01,2023-03-01,KOREA,ORG023,3.38,P004,NaN,NaN,NaN,Y,8600,19,"Java, Salesforce",66
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
E00322,Y,23,학사 학위,부탐회,F,2024-09-01,NaN,KOREA,ORG014,0.00,P009,NaN,NaN,NaN,N,4500,0,Java,4
E00389,Y,23,학사 학위,초두반,F,2024-09-01,NaN,KOREA,ORG012,0.00,P009,NaN,NaN,NaN,N,4500,0,"Salesforce, Java",4
E00438,Y,23,학사 학위,권개득,M,2024-09-01,NaN,KOREA,ORG024,0.00,P009,NaN,NaN,NaN,N,4500,0,Python,4
E00304,Y,24,학사 학위,탐출조,M,2024-09-01,NaN,KOREA,ORG009,0.00,P009,NaN,NaN,NaN,N,4500,0,Salesforce,4
E00428,Y,24,학사 학위,을충나,F,2024-09-01,NaN,KOREA,ORG003,0.00,P009,NaN,NaN,NaN,N,4500,0,"Data Analysis, Python, Marketing",4

In [10]:
hr_info.sort_values(by='SALARY')

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
199,E00428,을충나,F,ORG003,P009,24,0,학사 학위,0.00,4500,NaN,4,"Data Analysis, Python, Marketing",Y,2024-09-01,NaN,NaN,NaN,KOREA,N
198,E00304,탐출조,M,ORG009,P009,24,0,학사 학위,0.00,4500,NaN,4,Salesforce,Y,2024-09-01,NaN,NaN,NaN,KOREA,N
182,E00183,용조담,F,ORG023,P009,22,0,학사 학위,0.00,4500,NaN,4,"Python, Java, Salesforce",Y,2024-03-01,NaN,NaN,NaN,KOREA,N
183,E00192,감옥신,F,ORG017,P009,22,0,학사 학위,0.00,4500,NaN,4,"Project Management, Python, Salesforce",N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
185,E00281,빈태봉,F,ORG021,P009,22,0,고등학교 졸업,0.00,4500,NaN,4,Java,N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7,E00487,고명초,F,ORG014,P004,47,20,석사 학위,1.81,8600,2022-03-01,49,"Marketing, Salesforce, Project Management",Y,2004-03-01,NaN,NaN,NaN,Japan,Y
4,E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y

In [11]:
#두가지 기준으로 정렬(나이, 연봉)
# 1. 나이순으로 오름차순 정렬
# 2. 나이가 같다면, 연봉으로 오름차순 정렬

hr_info.sort_values(by=['AGE', 'SALARY'])

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
182,E00183,용조담,F,ORG023,P009,22,0,학사 학위,0.00,4500,NaN,4,"Python, Java, Salesforce",Y,2024-03-01,NaN,NaN,NaN,KOREA,N
183,E00192,감옥신,F,ORG017,P009,22,0,학사 학위,0.00,4500,NaN,4,"Project Management, Python, Salesforce",N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
184,E00275,복판백,M,ORG017,P009,22,0,학사 학위,0.00,4500,NaN,4,"Marketing, Salesforce",N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
185,E00281,빈태봉,F,ORG021,P009,22,0,고등학교 졸업,0.00,4500,NaN,4,Java,N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
186,E00300,랑화구,F,ORG001,P009,22,0,학사 학위,0.00,4500,NaN,4,Marketing,Y,2024-03-01,NaN,NaN,NaN,KOREA,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13,E00411,구류길,M,ORG004,P004,48,18,박사 학위,4.87,8500,2024-03-01,37,"Data Analysis, Java, Python",Y,2006-03-01,NaN,NaN,NaN,USA,Y
10,E00294,중우방,F,ORG021,P004,48,19,박사 학위,2.56,8600,2023-03-01,12,"Python, Salesforce, Java",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y

In [13]:
hr_info.sort_values(by='AGE', ascending=False, inplace=True)

In [14]:
hr_info

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
8,E00169,제언로,M,ORG004,P004,48,20,학사 학위,3.90,8500,2022-03-01,32,"Salesforce, Data Analysis, Python",Y,2004-03-01,NaN,NaN,NaN,KOREA,Y
14,E00474,규아래,M,ORG016,P004,48,18,학사 학위,2.19,8300,2024-03-01,44,Python,Y,2006-03-01,NaN,NaN,NaN,India,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
188,E00315,탐말당,F,ORG019,P009,22,0,고등학교 졸업,0.00,4500,NaN,4,"Project Management, Java, Salesforce",Y,2024-03-01,NaN,NaN,NaN,KOREA,N
187,E00303,팽봉신,M,ORG030,P009,22,0,학사 학위,0.00,4500,NaN,4,"Java, Python",Y,2024-03-01,NaN,NaN,NaN,KOREA,N
186,E00300,랑화구,F,ORG001,P009,22,0,학사 학위,0.00,4500,NaN,4,Marketing,Y,2024-03-01,NaN,NaN,NaN,KOREA,N
185,E00281,빈태봉,F,ORG021,P009,22,0,고등학교 졸업,0.00,4500,NaN,4,Java,N,2024-03-01,2024-02-28,계약만료,N,KOREA,N
189,E00329,패조가,M,ORG005,P009,22,0,전문대 학위,0.00,4500,NaN,4,Salesforce,Y,2024-03-01,NaN,NaN,NaN,KOREA,N

In [26]:
#rank의 기본값: 작은 수가 1위(ascending=True)
#큰수가 1위 : (ascending=False)
or_agg['SALARY'].rank(ascending=False)

#or_agg에 "부서별 연봉 순위" 열을 새로 만들어서 데이터를 대입
or_agg['SALARY_RANK'] = or_agg['SALARY'].rank(ascending=False)

#랭크를 기준으로 부서별 연봉 순위가 1위인 순위부터 자세히 살펴보기
or_agg.sort_values('SALARY_RANK')

        ENAME  AGE  SERVICE_YEAR       SALARY  SALARY_RANK
ORG_CD
ORG007      7   36      8.000000  6728.571429          1.0
ORG011      5   37      8.400000  6660.000000          2.0
ORG002      4   34      7.500000  6550.000000          3.0
ORG016      8   35      7.250000  6500.000000          4.0
ORG003      5   34      7.600000  6480.000000          5.0
ORG004     11   35      7.000000  6445.454545          6.0
ORG021     12   34      6.666667  6400.000000          7.0
ORG010      3   33      5.666667  6300.000000          8.0
ORG029      4   35      6.500000  6275.000000          9.0
ORG027      7   33      5.714286  6228.571429         10.0
ORG025      8   31      5.500000  6200.000000         11.0
ORG028      4   34      5.250000  6150.000000         12.0
ORG022      4   32      3.750000  6025.000000         13.5
ORG014      8   32      5.000000  6025.000000         13.5
ORG008      5   32      5.200000  6020.000000         15.0
ORG006      6   30      4.166667  5966.666667         16.0
ORG013      8   32      3.625000  5950.000000         17.0
ORG024      5   30      4.400000  5740.000000         18.0
ORG018      6   30      3.000000  5716.666667         19.0
ORG012      5   29      2.600000  5680.000000         20.0
ORG023     12   30      3.083333  5658.333333         21.0
ORG030     10   29      2.400000  5550.000000         22.0
ORG005      8   29      2.000000  5525.000000         23.0
ORG009      5   29      2.200000  5520.000000         24.5
ORG017     10   29      2.700000  5520.000000         24.5
ORG019     10   29      2.400000  5440.000000         26.0
ORG026      5   26      0.400000  5140.000000         27.0
ORG020      3   26      0.333333  5066.666667         28.0
ORG001      6   26      0.333333  5033.333333         29.0
ORG015      3   24      0.000000  5000.000000         30.0

In [35]:
#4~6월까지 각 사람별로 지급된 급여를 컬럼으로 정리하고 싶다
pay_info_df = pay_info[pay_info["PAYMENT_DVCD"]=="월급"][["EID", "PAYMENT_DY", "PAYMENT_AMOUNT"]]

In [37]:
pay_info_df['PAYMENT_DY'].unique()

array([20240501, 20240401, 20240601])

In [41]:
#새로운 DF를 재구성
df_pivot = pay_info_df.pivot(index='EID', columns='PAYMENT_DY', values='PAYMENT_AMOUNT')

In [39]:
pay_info_df

        EID  PAYMENT_DY  PAYMENT_AMOUNT
0    E00206    20240501             850
1    E00181    20240501             791
2    E00164    20240501             758
3    E00190    20240501             708
4    E00209    20240501             716
..      ...         ...             ...
146  E00322    20240601             375
147  E00389    20240601             375
148  E00438    20240601             375
149  E00304    20240601             375
150  E00428    20240601             375

[453 rows x 3 columns]

In [45]:
df_pivot.reset_index(inplace=True)

In [46]:
df_pivot

PAYMENT_DY     EID  20240401  20240501  20240601
0           E00163       417       417       417
1           E00164       758       758       758
2           E00165       416       416       416
3           E00167       608       608       608
4           E00169       708       708       708
..             ...       ...       ...       ...
146         E00487       716       716       716
147         E00491       575       575       575
148         E00496       558       558       558
149         E00497       566       566       566
150         E00499       566       566       566

[151 rows x 4 columns]

In [54]:
df_pivot.melt(id_vars='EID', value_vars=[20240401, 20240501, 20240601]).rename(columns={'value':'pay'})

        EID PAYMENT_DY  pay
0    E00163   20240401  417
1    E00164   20240401  758
2    E00165   20240401  416
3    E00167   20240401  608
4    E00169   20240401  708
..      ...        ...  ...
448  E00487   20240601  716
449  E00491   20240601  575
450  E00496   20240601  558
451  E00497   20240601  566
452  E00499   20240601  566

[453 rows x 3 columns]

In [53]:
df_pivot.columns

Index(['EID', 20240401, 20240501, 20240601], dtype='object', name='PAYMENT_DY')

In [48]:
df = pd.DataFrame({
    '반': ['1반', '2반'],
    '평균키': [170, 168],
    '평균몸무게': [65, 64]
})

In [49]:
df

    반  평균키  평균몸무게
0  1반  170     65
1  2반  168     64

In [55]:
df.melt(id_vars='반', value_vars=['평균키', '평균몸무게']).rename(columns={'variable' : '구분', 'value' : '값'})

    반     구분    값
0  1반    평균키  170
1  2반    평균키  168
2  1반  평균몸무게   65
3  2반  평균몸무게   64

In [ ]:
#행 삭제
hr_info.drop(0)
hr_info.drop([2,12]) #2번, 12번 인덱스 삭제
#열 삭제
hr_info.drop("ENAME", axis=1)

In [57]:
before_2 = pd.DataFrame({
    '학년': [1, 2, 3],
    '남자_키': [160, 165, 170],
    '남자_몸무게': [50, 55, 60],
    '여자_키': [158, 162, 168],
    '여자_몸무게': [48, 52, 57]
})

before_2

   학년  남자_키  남자_몸무게  여자_키  여자_몸무게
0   1   160      50   158      48
1   2   165      55   162      52
2   3   170      60   168      57

In [62]:
before_2.melt(id_vars='학년', 
              value_vars = ['남자_키','남자_몸무게','여자_키','여자_몸무게']
             ).rename(columns={'variable' : '구분', 'value' : '값'})

    학년      구분    값
0    1    남자_키  160
1    2    남자_키  165
2    3    남자_키  170
3    1  남자_몸무게   50
4    2  남자_몸무게   55
5    3  남자_몸무게   60
6    1    여자_키  158
7    2    여자_키  162
8    3    여자_키  168
9    1  여자_몸무게   48
10   2  여자_몸무게   52
11   3  여자_몸무게   57